
const singers = [
  "Назик Абдымамытова","AGA-INI тобу","60'K тобу","Ak Orgo Boys & AB-92",
  "Arman","CeeTee тобу","DELMAR тобу","Dixon","EMU STAR",
  "Gulzada","KG Эльмурат","King Macarella","Mr. Баха","NO COMMENT",
  "NON-STOP","OAKLAND","STYLE MIX","Ulikson","Zari",
  "Аалы Туткучев","Абаз Муратов","Абдыманап Төрөбеков","Абидин Темиров",
  "Абир Касенов","Аваз Акимов","Автандил","АГК тобу","Адил Чекилов",
  "Адилет Азимов","Азалия","Азамат Исмаилов","Азамат Сарыбаев",
  "Азамат Токтокадыров","Азамат Шералиев","Азамат Эркинбаев","Азат Болотбек",
  "Азат Раимбердиев","Азиз Батыров","Азиз Жетигенов","Азиза","Азур",
  "Аида Багышбекова","Аида Баякова","Аида Кулева","Аида Маканбаева",
  "Айар","Айбек Жуманов","Айбек Замиров","Айбек Карымов","Айбек Касымов",
  "Айгүл Чалова","Айганыш Абдиева","Айгерим Расул кызы","Айгерим Токтобаева",
  "Айгерим Эшим","Айдана Дека","Айдин Шер","Айжамал Кабылова",
  "Айжан Газиева","Айзада Жамгырчиева","АЙКӨЛ тобу","Айнура Салахадинова",
  "Айпери Кубик кызы","Айпери Кулбаева","Айпери Сыдыкова","Айпери Шерипова",
  "Айтурган Эрмекова","Айчурек Иманалиева","Айымжан","Айя Садырова",
  "Акбар Суйунбаев","Акжолтой Канатбек уулу","Акмаанай Эшбаева","Акмарал Жоробаева",
  "Актан Исабаев","Алекс","Алина Жетигенова","Алиса","Алихан","Алиша Диа",
  "Алишер Тоотаев","Алмаз Адамалиев","Алмаз Аман","Алмаз Шаадаев",
  "Алсейт Мырза","Алтымыш Кадыров","Алтын Дастанов","Алтынай Асанбекова",
  "Алтынай Жайнакова","Алтынай Нарбаева","Алтынбек Алымов","Алтынбек Борошов",
  "Алтынбек Мадмаров","Алтынбек Сапаралиев","Алькамиль","Амир Аскаров",
  "Анапия Райымбекова","Анарбек Ибраев","Анжелика","Апаз Жайнаков","Арген",
  "Арзыбек Бедияров","Арсен","Арстан Абдылдаев","Артык Сайтов","Асан Сапаркулов",
  "Асанкалы Керимбаев","Асель Кадырбекова","Асель Касымова","Асель Турдалиева",
  "Асема","Асия","Аскат Мусабеков","Аско","Аслан Исабаев","Асылбек Изааков",
  "Асылбек Насирдинов","Асылбек Өзүбеков","Атай Огонбаев","АТУШ тобу","АЯН тобу",
  "Аяна Касымова","Байыш Момунов","Байэл","Бактарбек Абдыразаков","БактиНур",
  "Бактыгул Бадыева","Бактыгул Бокоева","Бактыгул Жамгырчы кызы","Бакыт Мамаев",
  "Бакыт Шатенов","Батма Султанова","Баян Акматов","Баян Сыдыкова","Баястан",
  "Бегимай Бекбоева","Бегимай Карабаева","Бегимай Эсенгулова","Бегиш","Бек Борбиев",
  "Бек Исраилов","Бексултан Алимбеков","Бексултан Эрназаров","Бекчоро",
  "БЕРЕКЕ","БИЗ тобу","Биржан Байбол","Болот Тасмаев","Болот Токтобаев",
  "Борончу Кудайбергенов","Булан","Бураш","Бурул Аруннова","Венера Назарлиева",
  "Венера Сатылганова","Гулира Жапаркулова","Гуланда","Гулбу Ороскул кызы",
  "Гулжигит Калыков","Гулжигит Сатыбеков","Гулзаир Сагынова","Гулзат Байзакова",
  "Гулзат Батырканова","Гулзат Мамытбек","Гулзина Мамаева","Гулзинат Суранчиева",
  "Гулназ Бекбосун кызы","Гулназ Чыныбек кызы","Гулнара Калдарова",
  "Гулнара Кахарова","Гулнара Тойгонбаева","Гулнур Асанова","Гулнур Сатылганова",
  "Гулсун Бостонкулова","Гулсун Мамашева","Дайыр Исмадияров","Дамир Токтосунов",
  "Дамира Ниязбекова","Даниель","Даниель DN","Данияр Эрматов","Дархан","Дастан Осмонов",
  "ДЕЛБИРИМ","Деля Беркиналиева","Джонни","Дилбар Райымбекова","Дилшат Кангелдиева",
  "Дима Пазылов","Динара Акулова","Динара Багышбаева","Динара Жусаева",
  "Динара Тилекеева","Дмитрий Жумалиев","Добр","ДОБУЛБАС","Дорик Абдырахманов",
  "ДОСТОР","Дуйшен Узен","Жазгул Эстебесова","Жайнагул Калчаева","Жакут Сыдыков",
  "Жамиля Муратова","Жан Сабыров","Жан-Асель","Жанета Баялиева","Жаныбек Алыкулов",
  "Жаныбек Онолбаев","Жаным Айзат","Жаныш Кочкоров","Жаныш Момунов","ЖанЭл",
  "ЖАШ КЫЯЛ","ЖЕБЕ тобу","Жеңишбек Айтиев","Жеңишбек Жумакадыр","Жыпара Нуракова",
  "Залина Касымова","ЗАМАН тобу","Замир Арыкбаев","Замир Мырза","Зарема Асаналиева",
  "Зарина Хасанова","Зарлык Камбаралиев","Зейнеп Шаакеева","Зыпар Бейшекеев",
  "Ибрагим Жунусов","Ильгиз Абдалиев","Ильгиз Каныбеков","Ильич Бейшенбеков",
  "Ильяз Абдыразаков","Ильяз Андаш","Ильяс Кудретов","ИМПУЛЬС","Индира Кабылбаева",
  "Индира Эшиева","ИНСАН тобу","Ирина Шотт","Ирлан Таалайбеков","Иса Өмүркулов",
  "Исираддин Аманбаев","Ислам Акматов","Ислам Сатаров","Ишен Назаров",
  "Кадырaлы Артыков","Кайрат Примбердиев","Кайыргул","Калмурат Рыскулов",
  "Калыс Жакыпов","Калыс Жоомартов","Камчыбек Өскөнбаев","Каныкей","Каныкей Акын",
  "Каныкей Эралиева","Канымжан Жаманбаева","Кенже Дүйшеева","Кенже Кубатова",
  "Кенже Көбөкова","Керим Турапов","КЕҢЕШ тобу","Клара Алибекова","Кожакмат Исмаилов",
  "Кубаныч Ажыбаев","Кубаныч Баркалбасов","Кубаныч Сатаев","Кубатбек Алымкулов",
  "Кубик Калыков","Кудайберди Айтбосунов","Кумар Асанов","Кундуз","Кундуз Авашова",
  "Кундуз Канатбек кызы","Кундуз Таштаналиева","Куралбек Чокоев","Курмангазы Азыкбаев",
  "Кутман Жолдошев","Кутман Султанов","КЫЗ-БУРАК","Кыздаркан Келдибекова",
  "Кызсайкал","Кылыч Эдик","Кыргызбай Осмонов","Кыял Батырканова","Кыялбек Бакиров",
  "Лира","Лира Райымбекова","Лутфилла","Мажит","Майрам Дүйшекеева","Майрамбек Осмонов",
  "Майрамбек Шакиров","Макс Мырза","Максат Бегалиев","Максат Бекинов","Максат Кыштобаев",
  "Максат Садырбеков","Малик Аликеев","Малика Дина","Маматибраим Бостонкулов",
  "Манас Алыкулов","Марат Ибраев","Марс","Марсиана","Мая","Медер Кыдыршаев",
  "Мелис Абдрашитов","Мерген Турган","Микаэль","Милана","Минур Алтынбеков",
  "Минюра Рахимжанова","Мирана Мамытова","Мирбек Атабеков","Мирбек Иманбеков",
  "Мирбек Масалиев","Мирлан Абдыраев","Мирлан Баеков","Мирлан Жетигенов",
  "МУЗАМАН","Мукай Мырза","Мурадил Данияров","Мурадил Сагыналиев",
  "Мурат Ниматов","Мухаммед Осмонов","Мухтар Атаналиев","Мыктыбек Аширбай уулу",
  "Мыктыбек Мыйманбаев","Мыктыбек Нурланбеков","Мээри Шакулина",
  "Мээрим Карыпова","Мээрим Мураталиева","Надира Сарыкова","Назгул Токтакунова",
  "Назель","НАЗИК","Назара Кадыева","Назара Токонова","Назирдин Маматсултан уулу",
  "Назми","Наргиза Айтемирова","Нарынбек Калыбаев","Неля","Нияз Абдыразаков",
  "Нооруз Алымбаев","НУР тобу","Нур Чолпон","Нурайым Азыкбаева","Нурайым Акылбекова",
  "Нурак Абдырахманов","Нурбакыт Разаков","Нурбек Курманбеков","Нурбек Савитахунов",
  "Нургазы Абдуллаев","Нуржигит","Нурзада Жолдошева","Нурзат Садыкова","Нуриза Абазова",
  "Нурис","Нуркыз Кожонова","Нурлан Насип","Нурлан Раимберди","Нурлан Тилебаев",
  "Нурлан Турганбеков","Нурмат Садыров","Нурмира Асанова","Нурсултан Азыкбаев",
  "НурЧолпон","Нэна","Ома","Омар","Ордо Сахна","Орозгул Токторбаева","Оскар",
  "Райкан Абдувалиева","Раллия","Расул Маматкулов","Робин Жээнтаев","Роза Адильханова",
  "Роза Аманова","Роза Шакирова","Руслан Абылов","Руслан Нарынбаев","Руслан Чойбеков",
  "Рустам Сагыналиев","Рыспай Абдыкадыров","Сабина Омор","Сагын Эргешов",
  "Сагынбек Момбеков","Сагыныч","Сагыныч Нурланбек уулу","Сайкал Садыбаккасова",
  "Сайра Момунбаева","Саламат","Саламат Садыкова","Салима Балтаева","Салкынай Алиева",
  "Салтанат Аширова","Салтанат Тагаева","Салтанат Шекенова","Самара Каримова",
  "Самара Сабирова","Самара Токтакунова","Самат Аманов","Самат Деөлетбаков",
  "Самат Муратбекович","Самат Эркинбеков","Санжар Бердибеков","Санжар Төрегулов",
  "Сания","Сапар Айбашов","Сапар Сопубеков","Сапар Туратов","Сапар Эркебаев",
  "Сардар Туркменов","Светлана Назаренко","СЕЗИМ","Сема","Силима Абдылдаева",
  "Султан Каримов","Султан Садырлиев","Суран Садыбаков","Съездбек Искеналиев",
  "Сыймык Бейшекеев","Сырга Сағынбекова","Сүйүн Малабаев","Талант Анарбаев",
  "Талас Амантуров","Тамга","Тата Улан","Ташкент кызы Гул","Темир Дамирбеков",
  "Темир Назаров","Темирлан Масалбеков","Темирлан Өмүрбеков","Тилек Каныметов",
  "Тилек Найманбаев","Тилек Темиралиев","Тима Мукашев","Токон Эшбаев",
  "Токтобек Асаналиев","Токтобубу Черикчиева","Тола Турсуналиев","Толгонай Арзыкеева",
  "Топчубай Айтмататов","Тотомидин Жолдошов","Тургуналы Нурматов","Турдакун Ниязалиев",
  "Турдалы Аскарбеков","Тынай Алыбаев","Тынчтыкбек Айылчиев","Түгөлбай Казаков",
  "Түмөнбай Колдошов","Төлөгөн Мамыров","У-ЛИЦА","Улан Осмон уулу","Улук Назар",
  "Улук Тасмаев","Умутай Абдышова","Урмат Усенов","Фарида Карбосова","Фарида Өмүрзакова",
  "Фархат Кеңешбек уулу","Чолпон Талипбек","Чолпонай","ЧОРО тобу","Чубак Сатаев",
  "Чынарбек Сакеев","Чыпалак баатыр","Чырмаш Төрөбеков","Чыңгыз Мырзаев",
  "Чыңгыз Турдубеков","Шамшыбек Өтөбаев","ШАНТЕЛЛ","Шахра Талипова",
  "Шахрезада Аскарова","Шерхан Абкулов","Ынак Осмоналиев","Ынтымак","Ырыскелди",
  "Эдил Маматов","Элбарчын Калилова","Элдияр Кененсаров","Элдос Алмаз","ЭЛЕС",
  "Элзар Тиленбаев","Элиза Орозова","Элмира Кайып кызы","Элмирбек Иманалиев",
  "Эмил Балтагулов","Эмилия Бурканова","ЭНЕСАЙ","Эркин","Эркин Мукашев",
  "Эркинбек Мусаев","Эрлан Андашев","Эрмек Маматов","Эрнест Абдыжапаров",
  "Эрнест Бөрүбаев","Эрнест Жоошев","Эстебес Турсуналиев","Юлия Руцкая",
  "Умут Уметалиева","Өктөм Сапар уулу","ӨМҮР тобу","Өмурзак Кайыпов","Өсер Козуев"
];

const listContainer = document.getElementById('artistsList');
const searchInput = document.getElementById('searchInput');

function renderArtists(list) {
  listContainer.innerHTML = '';
  
  list.forEach(name => {
    const item = document.createElement('div');
    item.className = 'artist-item';
    
    
    const firstLetter = name.charAt(0);
    
    item.innerHTML = `
      <div class="artist-image-circle">${firstLetter}</div>
      <div class="artist-details">
        <span class="artist-name">${name}</span>
        <span class="artist-sub">Артист</span>
      </div>
    `;
    
    item.onclick = () => console.log(name + " тандалды");
    listContainer.appendChild(item);
  });
}


searchInput.addEventListener('input', (e) => {
  const term = e.target.value.toLowerCase();
  const filtered = singers.filter(s => s.toLowerCase().includes(term));
  renderArtists(filtered);
});


renderArtists(singers.sort());